# 1. напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# пример:
# - 6782 -> 23
# - 0,56 -> 11

print('Введите число:')
num = float (input())
