# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
#Пример:
#- 6 -> да
#- 7 -> да
#- 1 -> нет

print('Введите цифру')
a = int (input())
if a < 6 < 8:
    print('не является выходным днем')
else:
    print('является выходным днем')   